# topic : date and time data handling

In [2]:
import pandas as pd 
import numpy as np

In [3]:
date=pd.read_csv(r"C:\Users\mdfir\Downloads\orders.csv")
time=pd.read_csv(r"C:\Users\mdfir\Downloads\messages.csv")

In [4]:
date.head()

         date  product_id  city_id  orders
0  2019-12-10        5628       25       3
1  2018-08-15        3646       14     157
2  2018-10-23        1859       25       1
3  2019-08-17        7292       25       1
4  2019-01-06        4344       25       3

In [5]:
time.head()

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше

In [6]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   object
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: int64(3), object(1)
memory usage: 31.4+ KB

In [7]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

# change the time dtypes

In [9]:
date["date"]=pd.to_datetime(date["date"])

In [10]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   product_id  1000 non-null   int64
 2   city_id     1000 non-null   int64
 3   orders      1000 non-null   int64
dtypes: datetime64[ns](1), int64(3)
memory usage: 31.4 KB

# change the dtype time

In [12]:
time["date"]=pd.to_datetime(time["date"])

In [13]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

# extract year

In [15]:
date["date_year"]=date["date"].dt.year

In [16]:
date.head()

        date  product_id  city_id  orders  date_year
0 2019-12-10        5628       25       3       2019
1 2018-08-15        3646       14     157       2018
2 2018-10-23        1859       25       1       2018
3 2019-08-17        7292       25       1       2019
4 2019-01-06        4344       25       3       2019

# extract day

In [18]:
date["day_date"]=date["date"].dt.day

In [19]:
date.head()

        date  product_id  city_id  orders  date_year  day_date
0 2019-12-10        5628       25       3       2019        10
1 2018-08-15        3646       14     157       2018        15
2 2018-10-23        1859       25       1       2018        23
3 2019-08-17        7292       25       1       2019        17
4 2019-01-06        4344       25       3       2019         6

# extrect month

In [21]:
date["date_month_no"]=date["date"].dt.month

In [22]:
date["date_month"]=date["date"].dt.month_name()

In [23]:
date.head()

,date,product_id,city_id,orders,date_year,day_date,date_month_no,date_month
0,2019-12-10,5628,25,3,2019,10,12,December
1,2018-08-15,3646,14,157,2018,15,8,August
2,2018-10-23,1859,25,1,2018,23,10,October
3,2019-08-17,7292,25,1,2019,17,8,August
4,2019-01-06,4344,25,3,2019,6,1,January

# time

In [53]:
time["hour"]=time["date"].dt.hour

In [55]:
time["minute"]=time["date"].dt.minute

In [57]:
time["second"]=time["date"].dt.second

In [60]:
time.head()

,date,msg,hour,minute,second
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,0,31,0
4,2013-10-26 23:11:00,Зая я тебя никогда не обижу люблю тебя!) Даше,23,11,0